---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.NominalWeight
source: html/99ef3fbe-1ba0-bd35-4ab8-b0253ecf3015.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.NominalWeight Property

Unit weight (not mass) per unit length, for self-weight calculation or quantity survey.

## Syntax (C#)
```csharp
public double NominalWeight { get; set; }
```